In [2]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Lesson 10: Groups ##

## Grouping by One Column ##

In [3]:
cones = Table.read_table('data/cones.csv')

In [4]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [5]:
cones.drop('Color').group('Flavor', np.average)

Flavor     | Price average
bubblegum  | 4.75
chocolate  | 5.08333
strawberry | 4.4

In [6]:
cones.drop('Color').group('Flavor', max)

Flavor     | Price max
bubblegum  | 4.75
chocolate  | 5.25
strawberry | 5.25

In [7]:
cones.drop('Color').group('Flavor', np.cumsum) #Thai's creation

/opt/conda/lib/python3.9/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  values = np.array(tuple(values))

Flavor     | Price cumsum
bubblegum  | [4.75]
chocolate  | [ 4.75 10.   15.25]
strawberry | [3.55 8.8 ]

## Lists

In [8]:
[1, 5, 'hello', 5.0]

[1, 5, 'hello', 5.0]

In [9]:
[1, 5, 'hello', 5.0, make_array(1,2,3)]

[1, 5, 'hello', 5.0, array([1, 2, 3])]

In [10]:
marbles = Table().read_table('data/marbles.csv')  #Smith added this... to delete later
marbles

Color | Shape       | Amount | Price
Red   | Round       | 4      | 1.3
Green | Rectangular | 6      | 1.3
Blue  | Rectangular | 12     | 2
Red   | Round       | 7      | 1.75
Green | Rectangular | 9      | 1.4
Green | Round       | 2      | 1

In [11]:
marbles.group('Color', sum) #Smith to delete later

Color | Shape sum | Amount sum | Price sum
Blue  |           | 12         | 2
Green |           | 17         | 3.7
Red   |           | 11         | 3.05

## Grouping by Two Columns ##

In [18]:
nba = Table.read_table('data/nba_salaries.csv').relabeled("'15-'16 SALARY", 'SALARY')
nba

PLAYER           | POSITION | TEAM          | SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

In [19]:
nba.group(['TEAM','POSITION'])

TEAM           | POSITION | count
Atlanta Hawks  | C        | 3
Atlanta Hawks  | PF       | 2
Atlanta Hawks  | PG       | 2
Atlanta Hawks  | SF       | 2
Atlanta Hawks  | SG       | 5
Boston Celtics | C        | 3
Boston Celtics | PF       | 2
Boston Celtics | PG       | 4
Boston Celtics | SF       | 2
Boston Celtics | SG       | 4
... (137 rows omitted)

In [20]:
nba.drop('PLAYER').group(['TEAM','POSITION'], np.sum)

TEAM           | POSITION | SALARY sum
Atlanta Hawks  | C        | 22.7563
Atlanta Hawks  | PF       | 22.005
Atlanta Hawks  | PG       | 9.7634
Atlanta Hawks  | SF       | 6
Atlanta Hawks  | SG       | 9.04846
Boston Celtics | C        | 7.3514
Boston Celtics | PF       | 6.17096
Boston Celtics | PG       | 19.8986
Boston Celtics | SF       | 8.83432
Boston Celtics | SG       | 8.03022
... (137 rows omitted)